PinkFluffyUnic0rn/stm32flight/main.c
#include <math.h>
#include <string.h>
#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>

#include "main.h"
#include "device.h"
#include "uartdebug.h"
#include "mpu6500.h"
#include "hp206c.h"
#include "esp8266.h"
#include "qmc5883l.h"
#include "dsp.h"
#include "crsf.h"
#include "w25.h"

// Max length for info packet
// sent back to operator
#define INFOLEN 512

// device numbers
#define MPU_DEV 0
#define HP_DEV 1
#define QMC_DEV 2
#define CRSF_DEV 3
#define DEV_COUNT 4

// timers prescaler
#define PRESCALER 48

// clock frequency
#define OCSFREQ 48000000

// period for main timer (used to timing periodic events)
#define TIMPERIOD 0xfff

// main timer ticks per second
#define TICKSPERSEC (OCSFREQ / PRESCALER)

// PWM settings
#define PWM_MAXCOUNT 2500

// Periodic events frequencies
#define PID_FREQ 1000
#define CALIB_FREQ 25
#define HP_FREQ 25
#define CRSF_FREQ 100
#define QMC_FREQ 100
#define LOG_FREQ 64

// MCU flash address where quadcopter settings is stored
#define USER_FLASH 0x0801f800

// quadcopter setting's slot
#define USER_SETSLOTS (0x80 / sizeof(struct settings))

// maximum telemetry packets count, depends on onboard flash size
#define LOG_MAXPACKS \
	(W25_TOTALSIZE / sizeof(struct logpack))

// telemetry packets buffer size
#define LOG_BUFSIZE (W25_PAGESIZE / sizeof(struct logpack))

#define LOG_PACKSIZE 16

// Timer events IDs
#define TEV_PID 	0
#define TEV_CHECK 	1
#define TEV_CALIB	2
#define TEV_HP		3
#define TEV_QMC		4
#define TEV_LOG		5
#define TEV_COUNT	6

// Debug connection port
#define SERVPORT 8880

// Timeout in seconds before quadcopter disarm
// when got no data from ERLS receiver
#define ELRS_TIMEOUT 2

// check if enough time passed to call periodic event again.
// ev -- periodic event's context.
#define checktimev(ev) ((ev)->ms > TICKSPERSEC / (ev)->freq)

// reset periodic event's counter. Used after every
// event's callback call.
// ev -- periodic event's context.
#define resettimev(ev) (ev)->ms = 0;

// update periodic event's counter.
// ev -- periodic event's context.
// s -- time in microseconds after last callback's call.
#define updatetimev(ev, s) (ev)->ms += (s);

// set value in current log frame
// pos -- value's position inside the frame
// val -- value itself
#define logwrite(pos, val) logbuf[logbufpos].data[(pos)] = (val);

enum ALTMODE {
	ALTMODE_ACCEL	= 0,
	ALTMODE_SPEED	= 1,
	ALTMODE_POS	= 2
};

// Quadcopter settings structure stored in MCU's flash
struct settings {
	float mx0, my0, mz0;	// magnetometer offset values for X, Y
				// and Z axes determinted by
				// calibration procedure

	float mxsc, mysc, mzsc;	// megnetormeter scaling values for Z,
				// Y and Z axes determinted by 
				// calibration procedure

	float magdecl;	// magnetic declination

	float ax0, ay0, az0;	// accelometer offset values for X, Y
				// and Z axes.

	float gx0, gy0, gz0;	// gyroscope offset values for X, Y
				// and Z axes.

	float roll0, pitch0, yaw0; // roll, pitch and yaw offset values

	float tcoef;		// time coefficient for pitch/roll
				// complimentary filter
	float ttcoef;		// time coefficient for vertical axis
				// acceleration pow-pass filter
	float atcoef;		// time coefficient for pressure
				// low-pass filter
	float climbcoef;	// time coefficient for climb rate
				// low-pass filter

	int speedpid;	// 1 if single PID loop for roll/pitch is used,
			// 0 if double loop is used

	int yawspeedpid; // 1 if single PID loop for yaw is used, 0 if
			 // double loop is used

	float p, i, d;	// P/I/D values for roll/pitch (used only in
			// double roll/pitch PID loop mode)

	float sp, si, sd;	// P/I/D values for roll/pitch
				// rotation speed

	float yp, yi, yd; // P/I/D values for yaw (used only in double
			  // yaw PID loop mode)

	float ysp, ysi, ysd;	// P/I/D values for yaw rotation speed

	float zsp, zsi,	zsd; // P/I/D values for vertical acceleration
	float cp, ci, cd; // P/I/D values for climbrate
	float ap, ai, ad; // P/I/D values for altitude
};

// telemetry packet stored in onboard flash
struct logpack {
	float data[LOG_PACKSIZE];
};

// Periodic event's context that holds event's settings
// and data needed beetween calls
struct timev {
	int ms;			// microseconds passed from
				// last triggering
	int freq;		// event frequency
	int (*cb)(int);		// event callback
};

// STM32 clocks and periphery devices initilization
void systemclock_config();
static void gpio_init();
static void i2c_init();
static void spi1_init();
static void dma_init();
static void tim1_init();
static void tim2_init();
static void adc1_init(void);
static void usart1_init();
static void usart2_init();
static void usart3_init();

// Init ESC's
static void esc_init();

// Init HP206c barometer
static void hp_init();

// Init MPU6050 IMU
static void mpu_init();

// Init QMC5883L magnetometer
static void qmc_init();

// Init ESP07
static void espdev_init();

// Init ERLS receiver driver
static void crsfdev_init();

// Init W25Q onboard flash memory
static void w25dev_init();

// STM32 perithery contexts
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;
I2C_HandleTypeDef hi2c1;
SPI_HandleTypeDef hspi1;
TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;
DMA_HandleTypeDef hdma_usart2_rx;

// Flight controller board's devices drivers
struct cdevice dev[DEV_COUNT];
struct bdevice flashdev;
struct esp_device espdev;
struct crsf_device crsfdev;

// DSP contexts
struct dsp_lpf tlpf;
struct dsp_lpf altlpf;
float temp;
struct qmc_data qmcdata;
float climbrate;

struct dsp_compl pitchcompl;
struct dsp_compl rollcompl;

struct dsp_compl climbratecompl;

struct dsp_pidval pitchpv;
struct dsp_pidval rollpv;
struct dsp_pidval pitchspv;
struct dsp_pidval rollspv;
struct dsp_pidval yawpv;
struct dsp_pidval yawspv;
struct dsp_pidval tpv;
struct dsp_pidval cpv;
struct dsp_pidval apv;

