PinkFluffyUnic0rn/stm32flight/main.c
			dsp_setpid(&pitchspv, st.sp, st.si, st.sd);
			dsp_setpid(&rollspv, st.sp, st.si, st.sd);
		}
		else if (strcmp(toks[1], "yaw") == 0) {
			if (strcmp(toks[2], "mode") == 0) {
				if (strcmp(toks[3], "double") == 0)
					st.yawspeedpid = 0;
				else if (strcmp(toks[3], "single") == 0)
					st.yawspeedpid = 1;
				else
					goto unknown;
			}
			else if (strcmp(toks[2], "p") == 0)
				st.yp = v;
			else if (strcmp(toks[2], "i") == 0)
				st.yi = v;
			else if (strcmp(toks[2], "d") == 0)
				st.yd = v;
			else
				goto unknown;

			dsp_setpid(&yawpv, st.yp, st.yi, st.yd);
		}
		else if (strcmp(toks[1], "syaw") == 0) {
			if (strcmp(toks[2], "p") == 0)
				st.ysp = v;
			else if (strcmp(toks[2], "i") == 0)
				st.ysi = v;
			else if (strcmp(toks[2], "d") == 0)
				st.ysd = v;
			else
				goto unknown;

			dsp_setpid(&yawspv, st.ysp, st.ysi, st.ysd);
		}
		else if (strcmp(toks[1], "climb") == 0) {
			if (strcmp(toks[2], "p") == 0)
				st.zsp = v;
			else if (strcmp(toks[2], "i") == 0)
				st.zsi = v;
			else if (strcmp(toks[2], "d") == 0)
				st.zsd = v;
			else
				goto unknown;

			dsp_setpid(&tpv, st.zsp, st.zsi, st.zsd);
		}
		else if (strcmp(toks[1], "climbrate") == 0) {
			if (strcmp(toks[2], "p") == 0)
				st.cp = v;
			else if (strcmp(toks[2], "i") == 0)
				st.ci = v;
			else if (strcmp(toks[2], "d") == 0)
				st.cd = v;
			else
				goto unknown;

			dsp_setpid(&cpv, st.cp, st.ci, st.cd);
		}
		else if (strcmp(toks[1], "altitude") == 0) {
			if (strcmp(toks[2], "p") == 0)
				st.ap = v;
			else if (strcmp(toks[2], "i") == 0)
				st.ai = v;
			else if (strcmp(toks[2], "d") == 0)
				st.ad = v;
			else
				goto unknown;

			dsp_setpid(&apv, st.ap, st.ai, st.ad);
		}
		else
			goto unknown;
	}
	else if (strcmp(toks[0], "compl") == 0) {
		st.tcoef = atof(toks[1]);

		dsp_initcompl(&pitchcompl, st.tcoef, PID_FREQ);
		dsp_initcompl(&rollcompl, st.tcoef, PID_FREQ);	
	}
	else if (strcmp(toks[0], "lpf") == 0) {
		if (strcmp(toks[1], "climb") == 0) {
			st.ttcoef = atof(toks[2]);

			dsp_initlpf(&tlpf, st.ttcoef, PID_FREQ);
		}
		else if (strcmp(toks[1], "climbrate") == 0) {
			st.climbcoef = atof(toks[2]);

			dsp_initcompl(&climbratecompl,
				st.climbcoef, HP_FREQ);
		}
		else if (strcmp(toks[1], "altitude") == 0) {
			st.atcoef = atof(toks[2]);

			dsp_initlpf(&altlpf, st.atcoef, HP_FREQ);
		}
		else
			goto unknown;
	}
	else if (strcmp(toks[0], "adj") == 0) {
		float v;

		v = atof(toks[2]);

		if (strcmp(toks[1], "roll") == 0)	st.roll0 = v;
		else if (strcmp(toks[1], "pitch") == 0)	st.pitch0 = v;
		else if (strcmp(toks[1], "yaw") == 0)	st.yaw0 = v;
		else if (strcmp(toks[1], "acc") == 0) {
			if (strcmp(toks[2], "x") == 0)
				st.ax0 = atof(toks[3]);
			else if (strcmp(toks[2], "y") == 0)
				st.ay0 = atof(toks[3]);
			else if (strcmp(toks[2], "z") == 0)
				st.az0 = atof(toks[3]);
		}
		else if (strcmp(toks[1], "gyro") == 0) {
			if (strcmp(toks[2], "x") == 0)
				st.gx0 = atof(toks[3]);
			else if (strcmp(toks[2], "y") == 0)
				st.gy0 = atof(toks[3]);
			else if (strcmp(toks[2], "z") == 0)
				st.gz0 = atof(toks[3]);
		}
		else if (strcmp(toks[1], "mag") == 0) {
			if (strcmp(toks[2], "x0") == 0)
				st.mx0 = atof(toks[3]);
			else if (strcmp(toks[2], "y0") == 0)
				st.my0 = atof(toks[3]);
			else if (strcmp(toks[2], "z0") == 0)
				st.mz0 = atof(toks[3]);
			else if (strcmp(toks[2], "xscale") == 0)
				st.mxsc = atof(toks[3]);
			else if (strcmp(toks[2], "yscale") == 0)
				st.mysc = atof(toks[3]);
			else if (strcmp(toks[2], "zscale") == 0)
				st.mzsc = atof(toks[3]);
			else if (strcmp(toks[2], "decl") == 0)
				st.magdecl = atof(toks[3]);
			else
				goto unknown;
		}
		else
			goto unknown;
	}
	else if (strcmp(toks[0], "log") == 0) {
		if (strcmp(toks[1], "set") == 0) {
			// flash erasing process takes time and blocks
			// other actions, so disarm for safety
			en = 0.0;
			setthrust(0.0, 0.0, 0.0, 0.0);

			// notify user when erasing is started
			sprintf(s, "erasing flash...\r\n");
			esp_send(&espdev, s);

			// set log size (0 is valid and
			// means to disable logging)
			if (atoi(toks[2]) > W25_TOTALSIZE)
				goto unknown;

			logsize = atoi(toks[2]);

			// erase telemetry flash no
			// respond during this process
			eraseflash(logsize);

			// notify user when telemetry flash is erased
			sprintf(s,"erased %u bytes of flash\r\n",
				logsize);
			esp_send(&espdev, s);

			// enable telemetry
			logtotal = 0;
			logflashpos = 0;
			logbufpos = 0;
		}
		else if (strcmp(toks[1], "get") == 0)
			printlog(s, atoi(toks[2]));
		else
			goto unknown;
	}
	else
		goto unknown;

	return 0;

unknown:
	snprintf(s, INFOLEN, "Unknown command: %s\r\n", cmd);
	esp_send(&espdev, s);

	return (-1);
}

// Set control values using CRSF packet.
//
// cd -- CRSF packet
// ms -- microsecond passed from last CRSF packet
int crsfcmd(const struct crsf_data *cd, int ms)
{
	float dt;

	// channel to on remote is used to turn on/off
	// erls control. If this channel has low state, all remote
	// commands will be ignored, but packet still continue to
	// comming
	elrs = (cd->chf[7] > 0.5) ? 1 : 0;

	// update ERLS timeout as we got packet
	elrstimeout = ELRS_TIMEOUT;

	if (!elrs) {
		en = 0.0;
		setthrust(0.0, 0.0, 0.0, 0.0);

		return 0;
	}

	// get time passed from last ERLS packet
	dt = ms / (float) TICKSPERSEC;

	// set pitch/roll targets based on
	// channels 1-2 values (it's a joystick on most remotes)
	rolltarget = cd->chf[0] * (M_PI / 4.0);
	pitchtarget = -cd->chf[1] * (M_PI / 4.0);

	if (cd->chf[4] < 0.0) {
		yawspeedpid = 0;
		yawtarget = circf(yawtarget + cd->chf[3] * dt * M_PI);
	}
	else {
		yawspeedpid = 1;
		yawtarget = -cd->chf[3] * M_PI;
	}

	if (cd->chf[6] < -0.25) {
		altmode = ALTMODE_ACCEL;
		thrust = (cd->chf[2] + 0.75) / 3.5;
	}
	else if (cd->chf[6] > 0.25) {
		altmode = ALTMODE_POS;
		thrust = (cd->chf[2] + 1.0) * 2.0;
	}
	else {
		altmode = ALTMODE_SPEED;
		thrust = cd->chf[2] * 1.5;
	}

	// if channel 9 is active (it's no-fix button on remote used
	// for testing), set reference altitude from current altitude
	if (cd->chf[8] > 0.0) {
		dsp_initcompl(&climbratecompl, st.climbcoef, HP_FREQ);

		alt0 = dsp_getlpf(&altlpf);
	}

	// enable motors if channel six has value
	// more than 50, disarm immediately otherwise
	en = (cd->chf[5] > 0.5) ? 1.0 : 0.0;

	if (en < 0.5)
		setthrust(0.0, 0.0, 0.0, 0.0);

